[Killed] ArithmeticOperator
src/utils/colorConversion.js:20:29
 
   // XYZ to RGB (using sRGB D65)
   const matrix = COLOR_CONFIG.XYZ_TO_RGB_MATRIX;
-  let r = X * matrix.r[0] + Y * matrix.r[1] + Z * matrix.r[2];
+  let r = X * matrix.r[0] + Y / matrix.r[1] + Z * matrix.r[2];
   let g = X * matrix.g[0] + Y * matrix.g[1] + Z * matrix.g[2];
   let b = X * matrix.b[0] + Y * matrix.b[1] + Z * matrix.b[2];
killedBy: colorConversion xyToRgb should scale brightness correctly at 50%
statusReason: expected 0 to be less than 0

[Killed] ArithmeticOperator
src/utils/colorConversion.js:22:29
   const matrix = COLOR_CONFIG.XYZ_TO_RGB_MATRIX;
   let r = X * matrix.r[0] + Y * matrix.r[1] + Z * matrix.r[2];
   let g = X * matrix.g[0] + Y * matrix.g[1] + Z * matrix.g[2];
-  let b = X * matrix.b[0] + Y * matrix.b[1] + Z * matrix.b[2];
+  let b = X * matrix.b[0] + Y / matrix.b[1] + Z * matrix.b[2];
 
   // Apply gamma correction
killedBy: colorConversion xyToRgb should scale brightness correctly at 50%
statusReason: expected 0 to be less than 0

[Killed] ConditionalExpression
src/utils/colorConversion.js:26:9
 
   // Apply gamma correction
   const gammaCorrect = (val) => {
-    if (val <= 0.0031308) return 12.92 * val;
+    if (true) return 12.92 * val;
     return 1.055 * Math.pow(val, 1.0 / 2.4) - 0.055;
   };
killedBy: colorConversion xyToRgb should scale brightness correctly at 50%
statusReason: expected 233 to be less than 233

[Survived] ArithmeticOperator
src/utils/colorConversion.js:27:12
   // Apply gamma correction
   const gammaCorrect = (val) => {
     if (val <= 0.0031308) return 12.92 * val;
-    return 1.055 * Math.pow(val, 1.0 / 2.4) - 0.055;
+    return 1.055 * Math.pow(val, 1.0 / 2.4) + 0.055;
   };
 

[Killed] ArithmeticOperator
src/utils/colorConversion.js:43:44
   }
 
   // Convert to 0-255 range
-  r = Math.max(0, Math.min(255, Math.round(r * 255)));
+  r = Math.max(0, Math.min(255, Math.round(r / 255)));
   g = Math.max(0, Math.min(255, Math.round(g * 255)));
   b = Math.max(0, Math.min(255, Math.round(b * 255)));
killedBy: colorConversion xyToRgb should convert red color correctly
statusReason: expected 0 to be greater than 44

[Killed] ObjectLiteral
src/utils/colorConversion.js:47:10
   g = Math.max(0, Math.min(255, Math.round(g * 255)));
   b = Math.max(0, Math.min(255, Math.round(b * 255)));
 
-  return { r, g, b };
+  return {};
 };
 
killedBy: colorConversion xyToRgb should convert xy coordinates to RGB with default brightness
statusReason: expected {} to have property "r"

[Killed] EqualityOperator
src/utils/colorConversion.js:64:7
   let r, g, b;
 
   // Calculate red
-  if (temp <= 66) {
+  if (temp > 66) {
     r = 255;
   } else {
killedBy: colorConversion mirekToRgb should convert warm white (454 mirek / 2200K)
statusReason: expected NaN to be greater than 39

[Killed] ConditionalExpression
src/utils/colorConversion.js:108:7
  * @returns {string|null} CSS rgb() color string or null
  */
 export const getLightColor = (light) => {
-  if (!light.on?.on) return null;
+  if (true) return null;
 
   const brightness = light.dimming?.brightness ?? 100;
killedBy: colorConversion getLightColor should return color for light with xy color data
statusReason: .toMatch() expects to receive a string, but got object

[Killed] ConditionalExpression
src/utils/colorConversion.js:122:7
   }
 
   // If no color data available, use intelligent fallback
-  if (!baseColor) {
+  if (false) {
     // Assume neutral white as default - prevents green flash during API data load
     // Most color-capable lights default to neutral/warm white
killedBy: colorConversion getLightColor should return warm dim color for very dim lights without color data
statusReason: Cannot read properties of null (reading 'r')

[Killed] ConditionalExpression
src/utils/colorConversion.js:131:9
     const BRIGHT_START = COLOR_CONFIG.DIM_THRESHOLD.BRIGHT_START;
 
     // For dim lights, use warm candlelight color
-    if (brightness < DIM_START) {
+    if (true) {
       return `rgb(${WARM_DIM_COLOR.r}, ${WARM_DIM_COLOR.g}, ${WARM_DIM_COLOR.b})`;
     }
killedBy: colorConversion getLightColor should blend warm dim at mid brightness without color data
statusReason: expected 'rgb(255, 200, 130)' not to be 'rgb(255, 200, 130)' // Object.is equality

[Killed] BlockStatement
src/utils/colorConversion.js:131:33
     const BRIGHT_START = COLOR_CONFIG.DIM_THRESHOLD.BRIGHT_START;
 
     // For dim lights, use warm candlelight color
-    if (brightness < DIM_START) {
-      return `rgb(${WARM_DIM_COLOR.r}, ${WARM_DIM_COLOR.g}, ${WARM_DIM_COLOR.b})`;
-    }
+    if (brightness < DIM_START) {}
     // For mid-range, blend between warm dim and neutral white
     else if (brightness < BRIGHT_START) {
killedBy: colorConversion getLightColor should return warm dim color for very dim lights without color data
statusReason: expected 'rgb(255, 245, 235)' to match /^rgb\(255, 200, 130\)$/

[Survived] ArithmeticOperator
src/utils/colorConversion.js:136:18
     }
     // For mid-range, blend between warm dim and neutral white
     else if (brightness < BRIGHT_START) {
-      const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
+      const t = (brightness + DIM_START) / (BRIGHT_START - DIM_START);
       const blendFactor = t * t * (3 - 2 * t);
       const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r * blendFactor);

[Survived] ArithmeticOperator
src/utils/colorConversion.js:137:27
     // For mid-range, blend between warm dim and neutral white
     else if (brightness < BRIGHT_START) {
       const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
-      const blendFactor = t * t * (3 - 2 * t);
+      const blendFactor = t / t * (3 - 2 * t);
       const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r * blendFactor);
       const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + DEFAULT_WHITE.g * blendFactor);

[Survived] ArithmeticOperator
src/utils/colorConversion.js:139:28
       const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
       const blendFactor = t * t * (3 - 2 * t);
       const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r * blendFactor);
-      const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + DEFAULT_WHITE.g * blendFactor);
+      const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) - DEFAULT_WHITE.g * blendFactor);
       const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) + DEFAULT_WHITE.b * blendFactor);
       return `rgb(${r}, ${g}, ${b})`;

[Survived] ArithmeticOperator
src/utils/colorConversion.js:140:48
       const blendFactor = t * t * (3 - 2 * t);
       const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r * blendFactor);
       const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + DEFAULT_WHITE.g * blendFactor);
-      const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) + DEFAULT_WHITE.b * blendFactor);
+      const b = Math.round(WARM_DIM_COLOR.b * (1 + blendFactor) + DEFAULT_WHITE.b * blendFactor);
       return `rgb(${r}, ${g}, ${b})`;
     }

[NoCoverage] BlockStatement
src/utils/colorConversion.js:153:32
   const BRIGHT_START = COLOR_CONFIG.DIM_THRESHOLD.BRIGHT_START;
 
   let blendFactor;
-  if (brightness <= DIM_START) {
-    blendFactor = 0; // Pure warm
-  } else if (brightness >= BRIGHT_START) {
+  if (brightness <= DIM_START) {} else if (brightness >= BRIGHT_START) {
     blendFactor = 1; // Pure color
   } else {

[Survived] ConditionalExpression
src/utils/colorConversion.js:153:7
   const BRIGHT_START = COLOR_CONFIG.DIM_THRESHOLD.BRIGHT_START;
 
   let blendFactor;
-  if (brightness <= DIM_START) {
+  if (false) {
     blendFactor = 0; // Pure warm
   } else if (brightness >= BRIGHT_START) {

[Killed] BlockStatement
src/utils/colorConversion.js:155:42
   let blendFactor;
   if (brightness <= DIM_START) {
     blendFactor = 0; // Pure warm
-  } else if (brightness >= BRIGHT_START) {
-    blendFactor = 1; // Pure color
-  } else {
+  } else if (brightness >= BRIGHT_START) {} else {
     const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
     blendFactor = t * t * (3 - 2 * t); // Smoothstep curve
killedBy: colorConversion getLightColor should return color for light with xy color data
statusReason: expected 'rgb(NaN, NaN, NaN)' to match /^rgb\(\d+, \d+, \d+\)$/

[Survived] ArithmeticOperator
src/utils/colorConversion.js:158:16
   } else if (brightness >= BRIGHT_START) {
     blendFactor = 1; // Pure color
   } else {
-    const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
+    const t = (brightness + DIM_START) / (BRIGHT_START - DIM_START);
     blendFactor = t * t * (3 - 2 * t); // Smoothstep curve
   }

[Survived] ArithmeticOperator
src/utils/colorConversion.js:159:32
     blendFactor = 1; // Pure color
   } else {
     const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
-    blendFactor = t * t * (3 - 2 * t); // Smoothstep curve
+    blendFactor = t * t * (3 - 2 / t); // Smoothstep curve
   }
 

[Killed] ConditionalExpression
src/utils/colorConversion.js:177:7
  * @returns {string|null} CSS box-shadow string or null
  */
 export const getLightShadow = (light, lightColor) => {
-  if (!lightColor || !light.on?.on) return null;
+  if (false) return null;
 
   const brightness = light.dimming?.brightness ?? 100;
killedBy: colorConversion getLightShadow should return null for lights that are off
statusReason: expected '0 4px 12px rgb(255, 255, 255)3c, 0 2p…' to be null

[Killed] ConditionalExpression
src/utils/colorConversion.js:182:7
   const brightness = light.dimming?.brightness ?? 100;
   const SHADOW_THRESHOLD = COLOR_CONFIG.SHADOW_THRESHOLD;
 
-  if (brightness < SHADOW_THRESHOLD) {
+  if (false) {
     // Dim lights: neutral shadow only
     return '0 2px 6px rgba(0, 0, 0, 0.15), 0 1px 3px rgba(0, 0, 0, 0.1)';
killedBy: colorConversion getLightShadow should return neutral shadow for dim lights
statusReason: expected '0 4px 12px rgb(255, 200, 130)04, 0 2p…' to be '0 2px 6px rgba(0, 0, 0, 0.15), 0 1px …' // Object.is equality

[Killed] EqualityOperator
src/utils/colorConversion.js:182:7
   const brightness = light.dimming?.brightness ?? 100;
   const SHADOW_THRESHOLD = COLOR_CONFIG.SHADOW_THRESHOLD;
 
-  if (brightness < SHADOW_THRESHOLD) {
+  if (brightness >= SHADOW_THRESHOLD) {
     // Dim lights: neutral shadow only
     return '0 2px 6px rgba(0, 0, 0, 0.15), 0 1px 3px rgba(0, 0, 0, 0.1)';
killedBy: colorConversion getLightShadow should return neutral shadow for dim lights
statusReason: expected '0 4px 12px rgb(255, 200, 130)04, 0 2p…' to be '0 2px 6px rgba(0, 0, 0, 0.15), 0 1px …' // Object.is equality

[Killed] ArithmeticOperator
src/utils/colorConversion.js:187:38
     return '0 2px 6px rgba(0, 0, 0, 0.15), 0 1px 3px rgba(0, 0, 0, 0.1)';
   } else {
     // Bright lights: colored glow + depth shadow
-    const glowIntensity = Math.round(((brightness - SHADOW_THRESHOLD) / (100 - SHADOW_THRESHOLD)) * 40 + 20);
+    const glowIntensity = Math.round((brightness - SHADOW_THRESHOLD) / (100 - SHADOW_THRESHOLD) / 40 + 20);
     const glowOpacity = glowIntensity.toString(16).padStart(2, '0');
     return `0 4px 12px ${lightColor}${glowOpacity}, 0 2px 4px rgba(0, 0, 0, 0.1)`;
killedBy: colorConversion getLightShadow should scale glow intensity with brightness
statusReason: expected 20 to be greater than 20
