[Killed] BlockStatement
src/utils/roomUtils.js:7:59
  * @param {string} roomUuid - Room UUID
  * @returns {Array} Array of scene objects with uuid and name
  */
-export const getScenesForRoom = (scenesData, roomUuid) => {
-  if (!scenesData?.data) return [];
-
-  return scenesData.data
-    .filter(scene => scene.group?.rid === roomUuid)
-    .map(scene => ({
-      id: scene.id,
-      uuid: scene.id,
-      name: scene.metadata?.name || 'Unknown Scene',
-      metadata: scene.metadata
-    }))
-    .sort((a, b) => a.name.localeCompare(b.name));
-};
+export const getScenesForRoom = (scenesData, roomUuid) => {};
 
 /**
killedBy: roomUtils getScenesForRoom should return empty array when no scenes data
statusReason: expected undefined to deeply equal []

[Killed] OptionalChaining
src/utils/roomUtils.js:8:8
  * @returns {Array} Array of scene objects with uuid and name
  */
 export const getScenesForRoom = (scenesData, roomUuid) => {
-  if (!scenesData?.data) return [];
+  if (!scenesData.data) return [];
 
   return scenesData.data
killedBy: roomUtils getScenesForRoom should return empty array when no scenes data
statusReason: Cannot read properties of null (reading 'data')

[Killed] ConditionalExpression
src/utils/roomUtils.js:8:7
  * @returns {Array} Array of scene objects with uuid and name
  */
 export const getScenesForRoom = (scenesData, roomUuid) => {
-  if (!scenesData?.data) return [];
+  if (true) return [];
 
   return scenesData.data
killedBy: roomUtils getScenesForRoom should filter scenes by room UUID
statusReason: expected [] to have a length of 2 but got +0

[Killed] MethodExpression
src/utils/roomUtils.js:10:10
 export const getScenesForRoom = (scenesData, roomUuid) => {
   if (!scenesData?.data) return [];
 
-  return scenesData.data
-    .filter(scene => scene.group?.rid === roomUuid)
-    .map(scene => ({
-      id: scene.id,
-      uuid: scene.id,
-      name: scene.metadata?.name || 'Unknown Scene',
-      metadata: scene.metadata
-    }))
-    .sort((a, b) => a.name.localeCompare(b.name));
+  return scenesData.data.filter(scene => scene.group?.rid === roomUuid).map(scene => ({
+  id: scene.id,
+  uuid: scene.id,
+  name: scene.metadata?.name || 'Unknown Scene',
+  metadata: scene.metadata
+}));
 };
 
killedBy: roomUtils getScenesForRoom should sort scenes alphabetically by name
statusReason: expected 'Zzz Sleep' to be 'Aaa Morning' // Object.is equality

[Killed] ConditionalExpression
src/utils/roomUtils.js:11:22
   if (!scenesData?.data) return [];
 
   return scenesData.data
-    .filter(scene => scene.group?.rid === roomUuid)
+    .filter(scene => false)
     .map(scene => ({
       id: scene.id,
killedBy: roomUtils getScenesForRoom should filter scenes by room UUID
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/utils/roomUtils.js:11:22
   if (!scenesData?.data) return [];
 
   return scenesData.data
-    .filter(scene => scene.group?.rid === roomUuid)
+    .filter(scene => true)
     .map(scene => ({
       id: scene.id,
killedBy: roomUtils getScenesForRoom should filter scenes by room UUID
statusReason: expected [ { id: 'scene-1', …(3) }, …(2) ] to have a length of 2 but got 3

[Killed] ArrowFunction
src/utils/roomUtils.js:12:10
 
   return scenesData.data
     .filter(scene => scene.group?.rid === roomUuid)
-    .map(scene => ({
-      id: scene.id,
-      uuid: scene.id,
-      name: scene.metadata?.name || 'Unknown Scene',
-      metadata: scene.metadata
-    }))
+    .map(() => undefined)
     .sort((a, b) => a.name.localeCompare(b.name));
 };
killedBy: roomUtils getScenesForRoom should filter scenes by room UUID
statusReason: Cannot read properties of undefined (reading 'uuid')

[Killed] ObjectLiteral
src/utils/roomUtils.js:12:20
 
   return scenesData.data
     .filter(scene => scene.group?.rid === roomUuid)
-    .map(scene => ({
-      id: scene.id,
-      uuid: scene.id,
-      name: scene.metadata?.name || 'Unknown Scene',
-      metadata: scene.metadata
-    }))
+    .map(scene => ({}))
     .sort((a, b) => a.name.localeCompare(b.name));
 };
killedBy: roomUtils getScenesForRoom should filter scenes by room UUID
statusReason: Cannot read properties of undefined (reading 'localeCompare')

[Killed] ConditionalExpression
src/utils/roomUtils.js:15:13
     .map(scene => ({
       id: scene.id,
       uuid: scene.id,
-      name: scene.metadata?.name || 'Unknown Scene',
+      name: false,
       metadata: scene.metadata
     }))
killedBy: roomUtils getScenesForRoom should filter scenes by room UUID
statusReason: a.name.localeCompare is not a function

[Killed] LogicalOperator
src/utils/roomUtils.js:15:13
     .map(scene => ({
       id: scene.id,
       uuid: scene.id,
-      name: scene.metadata?.name || 'Unknown Scene',
+      name: scene.metadata?.name && 'Unknown Scene',
       metadata: scene.metadata
     }))
killedBy: roomUtils getScenesForRoom should sort scenes alphabetically by name
statusReason: expected 'Unknown Scene' to be 'Aaa Morning' // Object.is equality

[Killed] OptionalChaining
src/utils/roomUtils.js:29:29
  * @returns {Object} Room map with light assignments
  */
 export const buildRoomHierarchy = (lightsData, roomsData, devicesData) => {
-  if (!lightsData?.data || !roomsData?.data || !devicesData?.data) return null;
+  if (!lightsData?.data || !roomsData.data || !devicesData?.data) return null;
 
   // Helper to get light by UUID
killedBy: roomUtils buildRoomHierarchy should return null when missing data
statusReason: Cannot read properties of null (reading 'data')

[Killed] OptionalChaining
src/utils/roomUtils.js:29:8
  * @returns {Object} Room map with light assignments
  */
 export const buildRoomHierarchy = (lightsData, roomsData, devicesData) => {
-  if (!lightsData?.data || !roomsData?.data || !devicesData?.data) return null;
+  if (!lightsData.data || !roomsData?.data || !devicesData?.data) return null;
 
   // Helper to get light by UUID
killedBy: roomUtils buildRoomHierarchy should return null when missing data
statusReason: Cannot read properties of null (reading 'data')

[Killed] ConditionalExpression
src/utils/roomUtils.js:33:42
 
   // Helper to get light by UUID
   const getLightByUuid = (uuid) => {
-    return lightsData.data.find(light => light.id === uuid);
+    return lightsData.data.find(light => true);
   };
 
killedBy: roomUtils buildRoomHierarchy should filter out null lights
statusReason: expected [ { id: 'light-1', …(1) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/utils/roomUtils.js:39:24
   // Build device → lights map
   const deviceToLights = {};
   devicesData.data.forEach(device => {
-    const lightUuids = device.services
-      ?.filter(s => s.rtype === 'light')
-      .map(s => s.rid) || [];
+    const lightUuids = false;
     deviceToLights[device.id] = lightUuids;
   });
killedBy: roomUtils buildRoomHierarchy should build room to light mapping via devices
statusReason: expected { Object (Unassigned) } to have property "Living Room"

[Killed] EqualityOperator
src/utils/roomUtils.js:40:21
   const deviceToLights = {};
   devicesData.data.forEach(device => {
     const lightUuids = device.services
-      ?.filter(s => s.rtype === 'light')
+      ?.filter(s => s.rtype !== 'light')
       .map(s => s.rid) || [];
     deviceToLights[device.id] = lightUuids;
killedBy: roomUtils buildRoomHierarchy should build room to light mapping via devices
statusReason: expected { Object (Unassigned) } to have property "Living Room"

[Killed] ConditionalExpression
src/utils/roomUtils.js:53:11
 
     // Get lights from room's devices
     room.children?.forEach(child => {
-      if (child.rtype === 'device') {
+      if (true) {
         const deviceLights = deviceToLights[child.rid] || [];
         lightUuids.push(...deviceLights);
killedBy: roomUtils buildRoomHierarchy should handle direct light references in rooms
statusReason: Cannot read properties of undefined (reading 'lights')

[Killed] BlockStatement
src/utils/roomUtils.js:56:43
       if (child.rtype === 'device') {
         const deviceLights = deviceToLights[child.rid] || [];
         lightUuids.push(...deviceLights);
-      } else if (child.rtype === 'light') {
-        lightUuids.push(child.rid);
-      }
+      } else if (child.rtype === 'light') {}
     });
 
killedBy: roomUtils buildRoomHierarchy should handle direct light references in rooms
statusReason: Cannot read properties of undefined (reading 'lights')

[Killed] EqualityOperator
src/utils/roomUtils.js:61:9
       }
     });
 
-    if (lightUuids.length > 0) {
+    if (lightUuids.length >= 0) {
       roomMap[room.metadata?.name || 'Unknown Room'] = {
         roomUuid: room.id,
killedBy: roomUtils buildRoomHierarchy should handle rooms with no lights
statusReason: expected { 'Empty Room': { …(3) } } to not have property "Empty Room"

[Killed] ConditionalExpression
src/utils/roomUtils.js:62:15
     });
 
     if (lightUuids.length > 0) {
-      roomMap[room.metadata?.name || 'Unknown Room'] = {
+      roomMap[true] = {
         roomUuid: room.id,
         lightUuids: [...new Set(lightUuids)], // Deduplicate
killedBy: roomUtils buildRoomHierarchy should build room to light mapping via devices
statusReason: expected { true: { roomUuid: 'room-1', …(2) } } to have property "Living Room"

[Killed] EqualityOperator
src/utils/roomUtils.js:80:7
     light => !assignedLightUuids.has(light.id)
   );
 
-  if (unassignedLights.length > 0) {
+  if (unassignedLights.length <= 0) {
     roomMap['Unassigned'] = {
       roomUuid: null,
killedBy: roomUtils buildRoomHierarchy should create Unassigned room for lights not in any room
statusReason: expected { Bedroom: { …(3) } } to have property "Unassigned"

[Killed] BlockStatement
src/utils/roomUtils.js:96:51
  * @param {Array} roomLights - Array of light objects
  * @returns {Object} Stats object with lightsOnCount, totalLights, averageBrightness
  */
-export const calculateRoomStats = (roomLights) => {
-  if (!roomLights || roomLights.length === 0) {
-    return { lightsOnCount: 0, totalLights: 0, averageBrightness: 0 };
-  }
-
-  const lightsOnCount = roomLights.filter(light => light.on?.on).length;
-  const totalLights = roomLights.length;
-
-  // Calculate average brightness of lights that are on
-  const lightsOn = roomLights.filter(light => light.on?.on);
-  const averageBrightness = lightsOn.length > 0
-    ? lightsOn.reduce((sum, light) => {
-        // Use 50% as default during scene transitions when brightness data is loading
-        const brightness = light.dimming?.brightness ?? 50;
-        return sum + brightness;
-      }, 0) / lightsOn.length
-    : 0;
-
-  return { lightsOnCount, totalLights, averageBrightness };
-};
+export const calculateRoomStats = (roomLights) => {};
 
killedBy: roomUtils calculateRoomStats should return zeros for empty array
statusReason: expected undefined to deeply equal { lightsOnCount: +0, …(2) }

[Killed] ConditionalExpression
src/utils/roomUtils.js:97:7
  * @returns {Object} Stats object with lightsOnCount, totalLights, averageBrightness
  */
 export const calculateRoomStats = (roomLights) => {
-  if (!roomLights || roomLights.length === 0) {
+  if (false) {
     return { lightsOnCount: 0, totalLights: 0, averageBrightness: 0 };
   }
killedBy: roomUtils calculateRoomStats should return zeros for null input
statusReason: Cannot read properties of null (reading 'filter')

[Killed] LogicalOperator
src/utils/roomUtils.js:97:7
  * @returns {Object} Stats object with lightsOnCount, totalLights, averageBrightness
  */
 export const calculateRoomStats = (roomLights) => {
-  if (!roomLights || roomLights.length === 0) {
+  if (!roomLights && roomLights.length === 0) {
     return { lightsOnCount: 0, totalLights: 0, averageBrightness: 0 };
   }
killedBy: roomUtils calculateRoomStats should return zeros for null input
statusReason: Cannot read properties of null (reading 'length')

[Killed] ObjectLiteral
src/utils/roomUtils.js:98:12
  */
 export const calculateRoomStats = (roomLights) => {
   if (!roomLights || roomLights.length === 0) {
-    return { lightsOnCount: 0, totalLights: 0, averageBrightness: 0 };
+    return {};
   }
 
killedBy: roomUtils calculateRoomStats should return zeros for empty array
statusReason: expected {} to deeply equal { lightsOnCount: +0, …(2) }

[Killed] MethodExpression
src/utils/roomUtils.js:101:25
     return { lightsOnCount: 0, totalLights: 0, averageBrightness: 0 };
   }
 
-  const lightsOnCount = roomLights.filter(light => light.on?.on).length;
+  const lightsOnCount = roomLights.length;
   const totalLights = roomLights.length;
 
killedBy: roomUtils calculateRoomStats should count lights correctly
statusReason: expected 3 to be 2 // Object.is equality
