[Killed] OptionalChaining
src/utils/motionSensors.js:8:8
  * @returns {Array} Array of motion sensor objects
  */
 export const parseMotionSensors = (behaviorsData, motionAreasData) => {
-  if (!behaviorsData?.data || !motionAreasData?.data) return [];
+  if (!behaviorsData.data || !motionAreasData?.data) return [];
 
   // Create a map of motion area IDs to their motion status
killedBy: motionSensors parseMotionSensors should return empty array when no behaviors data
statusReason: Cannot read properties of null (reading 'data')

[Killed] BooleanLiteral
src/utils/motionSensors.js:8:31
  * @returns {Array} Array of motion sensor objects
  */
 export const parseMotionSensors = (behaviorsData, motionAreasData) => {
-  if (!behaviorsData?.data || !motionAreasData?.data) return [];
+  if (!behaviorsData?.data || motionAreasData?.data) return [];
 
   // Create a map of motion area IDs to their motion status
killedBy: motionSensors parseMotionSensors should return empty array when no motion areas data
statusReason: Cannot read properties of null (reading 'data')

[Killed] ConditionalExpression
src/utils/motionSensors.js:14:23
   const motionStatusMap = {};
   motionAreasData.data.forEach(area => {
     motionStatusMap[area.id] = {
-      motionDetected: area.motion?.motion || false,
+      motionDetected: false,
       motionValid: area.motion?.motion_valid !== false,
       enabled: area.enabled !== false,
killedBy: motionSensors parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/motionSensors.js:15:20
   motionAreasData.data.forEach(area => {
     motionStatusMap[area.id] = {
       motionDetected: area.motion?.motion || false,
-      motionValid: area.motion?.motion_valid !== false,
+      motionValid: true,
       enabled: area.enabled !== false,
       lastChanged: area.motion?.motion_report?.changed
killedBy: motionSensors parseMotionSensors should handle motion_valid being false
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/utils/motionSensors.js:16:16
     motionStatusMap[area.id] = {
       motionDetected: area.motion?.motion || false,
       motionValid: area.motion?.motion_valid !== false,
-      enabled: area.enabled !== false,
+      enabled: area.enabled === false,
       lastChanged: area.motion?.motion_report?.changed
     };
killedBy: motionSensors parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/motionSensors.js:16:16
     motionStatusMap[area.id] = {
       motionDetected: area.motion?.motion || false,
       motionValid: area.motion?.motion_valid !== false,
-      enabled: area.enabled !== false,
+      enabled: true,
       lastChanged: area.motion?.motion_report?.changed
     };
killedBy: motionSensors parseMotionSensors should handle area enabled being false
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/motionSensors.js:24:7
   // Extract MotionAware zones from behaviors and combine with motion status
   const motionZones = behaviorsData.data
     .filter(behavior =>
-      behavior.configuration?.motion?.motion_service?.rtype === 'convenience_area_motion'
+      true
     )
     .map(behavior => {
killedBy: motionSensors parseMotionSensors should filter out non-MotionAware behaviors
statusReason: Cannot read properties of undefined (reading 'motion_service')

[Killed] ConditionalExpression
src/utils/motionSensors.js:28:22
     )
     .map(behavior => {
       const motionServiceId = behavior.configuration.motion.motion_service.rid;
-      const status = motionStatusMap[motionServiceId] || {};
+      const status = false;
 
       return {
killedBy: motionSensors parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/motionSensors.js:33:25
       return {
         id: behavior.id,
         name: behavior.metadata?.name || 'Unknown Zone',
-        motionDetected: status.motionDetected || false,
+        motionDetected: false,
         enabled: behavior.enabled && status.enabled,
         reachable: status.motionValid !== false,
killedBy: motionSensors parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/motionSensors.js:34:18
         id: behavior.id,
         name: behavior.metadata?.name || 'Unknown Zone',
         motionDetected: status.motionDetected || false,
-        enabled: behavior.enabled && status.enabled,
+        enabled: false,
         reachable: status.motionValid !== false,
         lastChanged: status.lastChanged
killedBy: motionSensors parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utils/motionSensors.js:35:20
         name: behavior.metadata?.name || 'Unknown Zone',
         motionDetected: status.motionDetected || false,
         enabled: behavior.enabled && status.enabled,
-        reachable: status.motionValid !== false,
+        reachable: status.motionValid === false,
         lastChanged: status.lastChanged
       };
killedBy: motionSensors parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be true // Object.is equality
